org/blogs/cl-sudoku-write-up.org
#+title: Me writing my sudoku solver

Encountered a stuck solution problem

* setup                                 :noexport:

#+begin_src lisp :exports none
(defpackage cl-sudoku.test
  (:use #:cl #:cl-sudoku.solver #:cl-sudoku.sudoku))
(in-package :cl-sudoku.test)

(defparameter foo
  (sudoku-from-2d-array
   #2A((0 0 0 3 4 5 0 2 0)
       (3 4 9 7 0 6 0 0 1)
       (2 0 6 0 0 1 4 7 0)
       (1 0 2 0 7 9 0 8 5)
       (5 9 0 0 0 0 0 0 0)
       (0 6 0 0 0 0 2 1 9)
       (9 1 0 0 0 7 0 4 2)
       (0 2 7 9 1 3 0 6 0)
       (0 0 0 0 0 0 0 0 0))))
#+end_src

#+RESULTS:
: FOO

#+begin_src lisp :results raw
(in-package :cl-sudoku.test)

(sreset! foo)
(loop repeat 11
      collect (step-sudoku foo))
#+end_src

#+RESULTS:
((3 1 . 3) (3 6 . 6) (3 3 . 4) (1 7 . 5) (1 6 . 8) (1 4 . 2) (7 6 . 5)
 (6 6 . 3) (4 7 . 3) (8 7 . 9)
 "No progress found for the run, try stepping again")

#+begin_src lisp
(in-package :cl-sudoku.test)
(defvar steps
  '((3 1 . 3) (3 6 . 6) (3 3 . 4)
    (1 7 . 5) (1 6 . 8) (1 4 . 2)
    (7 6 . 5) (6 6 . 3) (4 7 . 3)
    (8 7 . 9)))
#+end_src

#+RESULTS:
: STEPS

* try step for breakdown                :noexport:

#+begin_src lisp
(in-package :cl-sudoku.test)

(defun try-i-step (i &optional (s foo) (steps* steps))
  (loop repeat i
        with arr = (alexandria:copy-array (sudoku--board s))
        for (x y . num) in steps*
        do (setf (aref arr x y) num)
        finally (return arr)))
#+end_src

#+RESULTS:
: TRY-I-STEP

#+begin_src lisp
(in-package :cl-sudoku.test)
(sreset! foo)
(try-i-step 1)
#+end_src

#+RESULTS:
: #2A((0 0 0 3 4 5 0 2 0)
:     (3 4 9 7 0 6 0 0 1)
:     (2 0 6 0 0 1 4 7 0)
:     (1 3 2 0 7 9 0 8 5)
:     (5 9 0 0 0 0 0 0 0)
:     (0 6 0 0 0 0 2 1 9)
:     (9 1 0 0 0 7 0 4 2)
:     (0 2 7 9 1 3 0 6 0)
:     (0 0 0 0 0 0 0 0 0))

#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(format t "~a~%" (nth 0 steps))
(format t "~a~%" (try-i-step 1))
#+end_src

#+RESULTS:
#+begin_example
(3 1 . 3)
#2A((0 0 0 3 4 5 0 2 0)
    (3 4 9 7 0 6 0 0 1)
    (2 0 6 0 0 1 4 7 0)
    (1 3 2 0 7 9 0 8 5)
    (5 9 0 0 0 0 0 0 0)
    (0 6 0 0 0 0 2 1 9)
    (9 1 0 0 0 7 0 4 2)
    (0 2 7 9 1 3 0 6 0)
    (0 0 0 0 0 0 0 0 0))
#+end_example


#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(format t "~a~%~a" (nth 1 steps) (try-i-step 2))
#+end_src

#+RESULTS:
#+begin_example
(3 6 . 6)
#2A((0 0 0 3 4 5 0 2 0)
    (3 4 9 7 0 6 0 0 1)
    (2 0 6 0 0 1 4 7 0)
    (1 3 2 0 7 9 6 8 5)
    (5 9 0 0 0 0 0 0 0)
    (0 6 0 0 0 0 2 1 9)
    (9 1 0 0 0 7 0 4 2)
    (0 2 7 9 1 3 0 6 0)
    (0 0 0 0 0 0 0 0 0))
#+end_example

#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(format t "~a~%~a" (nth 2 steps) (try-i-step 3))
#+end_src

#+RESULTS:
#+begin_example
(3 3 . 4)
#2A((0 0 0 3 4 5 0 2 0)
    (3 4 9 7 0 6 0 0 1)
    (2 0 6 0 0 1 4 7 0)
    (1 3 2 4 7 9 6 8 5)
    (5 9 0 0 0 0 0 0 0)
    (0 6 0 0 0 0 2 1 9)
    (9 1 0 0 0 7 0 4 2)
    (0 2 7 9 1 3 0 6 0)
    (0 0 0 0 0 0 0 0 0))
#+end_example


#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 3 steps) (try-i-step 4))
#+end_src

#+RESULTS:
#+begin_example
((1 7 . 5)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 0 6 0 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 0 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 0 4 2)
     (0 2 7 9 1 3 0 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example

#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 4 steps) (try-i-step 5))
#+end_src

#+RESULTS:
#+begin_example
((1 6 . 8)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 0 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 0 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 0 4 2)
     (0 2 7 9 1 3 0 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example


#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 5 steps) (try-i-step 6))
#+end_src

#+RESULTS:
#+begin_example
((1 4 . 2)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 2 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 0 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 0 4 2)
     (0 2 7 9 1 3 0 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example


#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 6 steps) (try-i-step 7))
#+end_src

#+RESULTS:
#+begin_example
((7 6 . 5)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 2 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 0 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 0 4 2)
     (0 2 7 9 1 3 5 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example


#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 7 steps) (try-i-step 8))
#+end_src

#+RESULTS:
#+begin_example
((6 6 . 3)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 2 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 0 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 3 4 2)
     (0 2 7 9 1 3 5 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example


#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 8 steps) (try-i-step 9))
#+end_src

#+RESULTS:
#+begin_example
((4 7 . 3)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 2 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 3 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 3 4 2)
     (0 2 7 9 1 3 5 6 0)
     (0 0 0 0 0 0 0 0 0)))
#+end_example

#+begin_src lisp
(in-package :cl-sudoku.test)
(list (nth 9 steps) (try-i-step 10))
#+end_src

#+RESULTS:
#+begin_example
((8 7 . 9)
 #2A((0 0 0 3 4 5 0 2 0)
     (3 4 9 7 2 6 8 5 1)
     (2 0 6 0 0 1 4 7 0)
     (1 3 2 4 7 9 6 8 5)
     (5 9 0 0 0 0 0 3 0)
     (0 6 0 0 0 0 2 1 9)
     (9 1 0 0 0 7 3 4 2)
     (0 2 7 9 1 3 5 6 0)
     (0 0 0 0 0 0 0 9 0)))
#+end_example

* Introduction
** Layout and the structure of this "blog"
** Why I wanted to write this Sudoku solver
I have tried writing a Sudoku solver before, one completed using a very simple brute-force depth-first backtrack searcher in C++ for an university assignment, another using a constraint based depth-first searcher in Clojure, in common lisp, etc, /in-completed/.

The simple brute-force was elegant, efficient and does the job, however, I have thought about how I myself solves the sudoku when I see it right in front of me, I want to make a program that solve the sudoku that way. This is the main motivation with this program, and there are two main goals behind this attempt:

1) to see to myself finishing a project from start to finish
   # manifest the outcome that I wished for.
2) to challenge myself, to complete something that I hadn't completed individually yet and with sudoku it isn't something too difficult that I would give up mid-way like many times before.
   # to beat past old myself, and make this step forward. Therefore, as much as this is a technical challenge (perhaps just two pieces of cake for some), there is as much as this is a psychological and spiritual challenge for me.

* analysis end game                     :noexport:

#+begin_src lisp
(in-package :cl-sudoku.test)
(sreset! foo)
(loop repeat 11
      collect (step-sudoku foo))
#+end_src

#+RESULTS:
: ((3 1 . 3) (3 6 . 6) (3 3 . 4) (1 7 . 5) (1 6 . 8) (1 4 . 2) (7 6 . 5) (6 6 . 3) (4 7 . 3) (8 7 . 9) No progress found for the run, try stepping again)

#+begin_src lisp
(in-package :cl-sudoku.test)
(sudoku--board foo)
#+end_src

#+RESULTS:
: #2A((0 0 0 3 4 5 0 2 0)
:     (3 4 9 7 2 6 8 5 1)
:     (2 0 6 0 0 1 4 7 0)
:     (1 3 2 4 7 9 6 8 5)
:     (5 9 0 0 0 0 0 3 0)
:     (0 6 0 0 0 0 2 1 9)
:     (9 1 0 0 0 7 3 4 2)
:     (0 2 7 9 1 3 5 6 0)
:     (0 0 0 0 0 0 0 9 0))

#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(loop for i from 0 below 9
      do (format t "~a ~a~%"
                 (1+ i) (srow-encoding foo i)))
#+end_src

#+RESULTS:
: 1 #*100001111
: 2 #*000000000
: 3 #*001010011
: 4 #*000000000
: 5 #*110101110
: 6 #*001110110
: 7 #*000011010
: 8 #*000100010
: 9 #*111111110

#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(loop for i from 0 below 9
      do (format t "~a ~a~%"
                 (1+ i) (scol-encoding foo i)))
#+end_src

#+RESULTS:
: 1 #*000101110
: 2 #*000010110
: 3 #*101110010
: 4 #*110011010
: 5 #*001011011
: 6 #*010100010
: 7 #*100000101
: 8 #*000000000
: 9 #*001101110

#+begin_src lisp :results output
(in-package :cl-sudoku.test)
(loop for i from 0 below 9
      do (format t "~a ~a~%"
                 (1+ i) (sregion-encoding foo i)))
#+end_src

#+RESULTS:
: 1 #*100010110
: 2 #*000000011
: 3 #*001001001
: 4 #*000100110
: 5 #*111011010
: 6 #*000100100
: 7 #*001111010
: 8 #*010111010
: 9 #*100000110


#+begin_src lisp
(in-package :cl-sudoku.test)
(loop for i from 0 below 9
      append
      (loop for j from 0 below 9
            if (zerop (sref foo i j))
              collect (list
                       i j
                       (get-candidates-at-ij foo i j))))
#+end_src

#+RESULTS:
| 0 | 0 | (6 7 8)     |
| 0 | 1 | (7 8)       |
| 0 | 2 | (1 8)       |
| 0 | 6 | (1 7 9)     |
| 0 | 8 | (6 7 8)     |
| 2 | 1 | (5 8)       |
| 2 | 3 | (5 8)       |
| 2 | 4 | (3 5 8 9)   |
| 2 | 8 | (3 8)       |
| 4 | 2 | (1 4 8)     |
| 4 | 3 | (1 2 6 8)   |
| 4 | 4 | (6 8)       |
| 4 | 5 | (2 4 8)     |
| 4 | 6 | (1 7)       |
| 4 | 8 | (4 6 7 8)   |
| 5 | 0 | (4 7 8)     |
| 5 | 2 | (3 4 5 8)   |
| 5 | 3 | (5 8)       |
| 5 | 4 | (3 5 8)     |
| 5 | 5 | (4 8)       |
| 6 | 2 | (5 8)       |
| 6 | 3 | (5 6 8)     |
| 6 | 4 | (5 6 8)     |
| 7 | 0 | (4 8)       |
| 7 | 8 | (4 8)       |
| 8 | 0 | (4 6 7 8)   |
| 8 | 1 | (5 7 8)     |
| 8 | 2 | (1 3 4 5 8) |
| 8 | 3 | (1 2 5 6 8) |
| 8 | 4 | (3 5 6 8)   |
| 8 | 5 | (2 4 8)     |
| 8 | 6 | (1 7)       |
| 8 | 8 | (3 4 6 7 8) |

* about                                 :noexport:
 Mind-draft, the approach and methodology behind the algorithm

* Introduction to Sudoku
# first version of the constrained Sudoku solver

#+begin_src lisp :results output :exports none
(in-package cl-sudoku.solver)
(pprint-sudoku foo)
#+end_src

#+RESULTS:
#+begin_example
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
#+end_example

Let's go through the basics of a sudoku, i.e. what is a sudoku.

The rule and the goal of sudoku is as follows: fill in the 9 by 9 grid with numbers from 1 to 9 in each columns and rows such that all columns, rows, and sub-grid contain a number from 1 to 9 uniquely. Here are some properties of a typical 9 by 9 sudoku:

- 9 rows, each labelled with 'i's
- 9 columns, each labelled with 'j's 
- and 9 sub-grid as seen in the ascii diagram below labelled from A to I

#+begin_example
   jjj jjj jjj
  ―――――――――――――
i │...│...│...│
i │.A.│.B.│.C.│
i │...│...│...│
  ―――――――――――――
i │...│...│...│
i │.D.│.E.│.F.│
i │...│...│...│
  ―――――――――――――
i │...│...│...│
i │.G.│.H.│.I.│
i │...│...│...│
  ―――――――――――――
#+end_example

For example, the following are "illegal":
#+begin_example
―――――――――――――
│251│...│..1│
│349│...│..2│
│286│...│..3│
―――――――――――――
│...│...│..4│
│...│...│..7│
│...│...│..8│
―――――――――――――
│...│...│..6│
│...│...│..5│
│123│455│789│
―――――――――――――
#+end_example

