html/blogs/cl-sudoku-write-up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-11 Sun 02:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Me writing my sudoku solver</title>
<meta name="author" content="Danny" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Me writing my sudoku solver</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org937be74">1. Introduction</a>
<ul>
<li><a href="#org892148f">1.1. Layout and the structure of this "blog"</a></li>
<li><a href="#org5c7d6cf">1.2. Why I wanted to write this Sudoku solver</a></li>
</ul>
</li>
<li><a href="#orgaf7eb93">2. Introduction to Sudoku</a></li>
<li><a href="#orgafabb15">3. Algorithm approach</a>
<ul>
<li><a href="#org9aa01de">3.1. How to translate into lisp code</a></li>
<li><a href="#org6ae3f81">3.2. More on encoding</a></li>
</ul>
</li>
<li><a href="#org8542daa">4. the second version</a></li>
<li><a href="#orga87bb33">5. the third version</a>
<ul>
<li><a href="#org74701af">5.1. motivation</a></li>
<li><a href="#org9883dac">5.2. progress</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Encountered a stuck solution problem
</p>
<div id="outline-container-org937be74" class="outline-2">
<h2 id="org937be74"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org892148f" class="outline-3">
<h3 id="org892148f"><span class="section-number-3">1.1.</span> Layout and the structure of this "blog"</h3>
</div>
<div id="outline-container-org5c7d6cf" class="outline-3">
<h3 id="org5c7d6cf"><span class="section-number-3">1.2.</span> Why I wanted to write this Sudoku solver</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I have tried writing a Sudoku solver before, one completed using a very simple brute-force depth-first backtrack searcher in C++ for an university assignment, another using a constraint based depth-first searcher in Clojure, in common lisp, etc, <i>in-completed</i>.
</p>

<p>
The simple brute-force was elegant, efficient and does the job, however, I have thought about how I myself solves the sudoku when I see it right in front of me, I want to make a program that solve the sudoku that way. This is the main motivation with this program, and there are two main goals behind this attempt:
</p>

<ol class="org-ol">
<li>to see to myself finishing a project from start to finish</li>
<li>to challenge myself, to complete something that I hadn't completed individually yet and with sudoku it isn't something too difficult that I would give up mid-way like many times before.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgaf7eb93" class="outline-2">
<h2 id="orgaf7eb93"><span class="section-number-2">2.</span> Introduction to Sudoku</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's go through the basics of a sudoku, i.e. what is a sudoku.
</p>

<p>
The rule and the goal of sudoku is as follows: fill in the 9 by 9 grid with numbers from 1 to 9 in each columns and rows such that all columns, rows, and sub-grid contain a number from 1 to 9 uniquely. Here are some properties of a typical 9 by 9 sudoku:
</p>

<ul class="org-ul">
<li>9 rows, each labelled with 'i's</li>
<li>9 columns, each labelled with 'j's</li>
<li>and 9 sub-grid as seen in the ascii diagram below labelled from A to I</li>
</ul>

<pre class="example" id="orgf605f6a">
   jjj jjj jjj
  ―――――――――――――
i │...│...│...│
i │.A.│.B.│.C.│
i │...│...│...│
  ―――――――――――――
i │...│...│...│
i │.D.│.E.│.F.│
i │...│...│...│
  ―――――――――――――
i │...│...│...│
i │.G.│.H.│.I.│
i │...│...│...│
  ―――――――――――――
</pre>

<p>
For example, the following are "illegal":
</p>
<pre class="example" id="org3ba86e5">
―――――――――――――
│251│...│..1│
│349│...│..2│
│286│...│..3│
―――――――――――――
│...│...│..4│
│...│...│..7│
│...│...│..8│
―――――――――――――
│...│...│..6│
│...│...│..5│
│123│455│789│
―――――――――――――
</pre>
</div>
</div>
