org/blogs/cl-sudoku-write-up.org
* Algorithm approach

Solving Sudoku is a solved and known problem, there are many widely available algorithms for solving Sudoku. For example, in as part of my University programming course, the most common approach was to use back-tracking. This time I want to experiment and figure out an approach.

Now this is a random sudoku I copied from one of the sudoku sites, which I googled for.

#+NAME: the-sudoku-table
#+begin_src lisp :results output :exports results
(in-package :cl-sudoku.test)
(pprint-sudoku foo :enclosed? t)
#+end_src

#+NAME: the-sudoku-table
#+RESULTS:
#+begin_example
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
#+end_example

I solved sudoku before, this time I want to come up with an algorithm that almost approach a sudoku like how I approached it as a human. So, how do I usually solve a sudoku problem?

First, I would look through the entire sudoku itself 9 by 9, simply with a glance, it's done with a combination of subconscious and the conscious! Then I would start to look at a position and start to reason what numbers can be placed at this position. For instance, at =(0,0)= there are 3,4,5 and 2 on the same row then column-wise, there are 3,2,1,5 and 9 reading down the first column in order. Combining the two gives a set of 1,2,3,4,5,,,9 with 6,7,8 missing. Ouu, but hang on I've missed out on the sub-grid A, which gives another 6. Finally that leaves the available candidates as either 7 or 8.

Actually we can narrow one step further, by taking advantage of the information from the other sub-grids, for instance, 7s in B and C have occupied the bottom two lanes, then the 7 must be in the top row for grid A. And then the same can be done for sub-grid D and G (which are the two sub-grids below A) etc.

Ok the above is what my brain does by doing a series of reasoning to eliminate and find out the right candidate or candidates, in this case its plural because there are multiple choices. By repeating this methodology, eventually there will be one position that will only have one possible candidate and the domino fall from there and after X number of steps the sudoku is solved.

** How to translate into lisp code

First of all, a data-structure is needed to hold the representation of a sudoku board in memory. In this case it's trivia to select a 2d array. In other more complicated computer problems, choosing and implementing the right data-structure will often help facilitate progress rather than hinder it, and choosing poorly will cause hindrance.

Anyhow, with a 2d array, the rows of a sudoku can be accessed with =O(1)= time. Accessing the columns is requires a bit more work. Although these matters less compared to the algorithm as because accessors for rows and columns are effectively function calls and the cost of the function in this case being row is both faster and cheaper can be optimized later on.

Moving onto the algorithm side, the program will start looking at one position at a time. For a position (i,j) it will look into the i-th row and j-th column and starts filtering down the possible candidates from there.

Normally, I would use a set to represent the combination of unique numbers from the row and column, for instance, in [[sudoku-foo--numbers-in-row0][numbers in 1st row]] we have the numbers from 1st row, and <> is the 1st column. The combined set is as shown in <>, with <> showing the missing numbers for that position.

#+name: sudoku-foo--numbers-in-row0
#+begin_src lisp :results value :exports results
(in-package :cl-sudoku.test)
(list
 (prin1-to-string
  (encoding->list-of-nums (bit-not (srow-encoding foo 0))))))
#+end_src

#+caption: Numbers in 1st row
#+RESULTS: sudoku-foo--numbers-in-row0
| (2 3 4 5) |

#+begin_src lisp :results value :exports results
(in-package :cl-sudoku.test)
(list
 (prin1-to-string
  (encoding->list-of-nums (bit-not (scol-encoding foo 0)))))
#+end_src

#+caption: Numbers in 1st column
#+RESULTS:
| (1 2 3 5 9) |

#+begin_src lisp :results value :exports results
(in-package :cl-sudoku.test)
(list
 (prin1-to-string
  (encoding->list-of-nums
   (bit-ior (bit-not (srow-encoding foo 0))
            (bit-not (scol-encoding foo 0))))))
#+end_src

#+caption: Numbers in 1st row and 1st column
#+RESULTS:
| (1 2 3 4 5 9) |

#+begin_src lisp :results value :exports results
(in-package :cl-sudoku.test)
(list
 (prin1-to-string
  (encoding->list-of-nums
   (bit-and (srow-encoding foo 0)
            (scol-encoding foo 0)))))
#+end_src

#+caption: Numbers missing with consideration in 1st row and 1st column
#+RESULTS:
| (6 7 8) |

Set is a good tool for holding the data I need. However, I wanted to try something different this time, with compactness in mind. The problem space here is, a way to encode the state of a row, column and region (sub-grid), given that each number from 1 to 9 are either present or missing. After some time I realized bit-mask is the right tool for this, what's better is that, there are boolean operation that helps combining two encodings. I settled with 1 as missing and 0 as present because of overlooked the operation "binary nor" and "binary and" only works with the chosen schema.

So as an example, if there is an encoding of =#*111000000= this means =1,2,3= are missing and the rest are present.

** More on encoding

#+begin_src lisp :exports none
(bits-and*
 (srow-encoding s i)
 (scol-encoding s j)
 (sregion-encoding s (s-row-col->region i j)))
#+end_src

let's say i is 0 and j is 6 and we get the following encoding:

|--------+-------------|
| Name   | encoding    |
|--------+-------------|
| row    | #*000001001 |
| column | #*100011011 |
| region | #*001011001 |
|--------+-------------|
| and*   | #*000001001 |
|--------+-------------|

The encoding translate back into the possible candidates for this position which are (counted from the LSB as 1):

| 6, | 9 |

My solver started to step through the sudoku and filling in the numbers in their respective positions.
But then it halted at step 10

* the second version

After looking carefully at the final state of the sudoku puzzle from the currently stuck position, I find out that all the empty spots were having more than 1 possible candidates, this prevented the solver from advancing to the next state.

It didn't took long to find out the solver wasn't taking the advantage of the numbers/information from the other "lanes" (rows and/or columns) to help narrow down the choice.

#+NAME: the-sudoku-table-second-time
#+begin_example
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
#+end_example

Let's look at position =(5,0)= there are may be up to four possible candidates judging by the 1,2,5,6,9 in the grid. However, if we were to take advantage of the 7s in the grid to the right and below, we can see the only possible place is =(5,0)=. This way of reasoning is what the algorithm need to progress further from the stuck state.

