html/blogs/cl-sudoku-write-up.html
<div id="outline-container-orgafabb15" class="outline-2">
<h2 id="orgafabb15"><span class="section-number-2">3.</span> Algorithm approach</h2>
<div class="outline-text-2" id="text-3">
<p>
Solving Sudoku is a solved and known problem, there are many widely available algorithms for solving Sudoku. For example, in as part of my University programming course, the most common approach was to use back-tracking. This time I want to experiment and figure out an approach.
</p>

<p>
Now this is a random sudoku I copied from one of the sudoku sites, which I googled for.
</p>

<pre class="example" id="org3ae44c0">
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
</pre>

<pre class="example" id="org3b2142c">
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
</pre>

<p>
I solved sudoku before, this time I want to come up with an algorithm that almost approach a sudoku like how I approached it as a human. So, how do I usually solve a sudoku problem?
</p>

<p>
First, I would look through the entire sudoku itself 9 by 9, simply with a glance, it's done with a combination of subconscious and the conscious! Then I would start to look at a position and start to reason what numbers can be placed at this position. For instance, at <code>(0,0)</code> there are 3,4,5 and 2 on the same row then column-wise, there are 3,2,1,5 and 9 reading down the first column in order. Combining the two gives a set of 1,2,3,4,5,,,9 with 6,7,8 missing. Ouu, but hang on I've missed out on the sub-grid A, which gives another 6. Finally that leaves the available candidates as either 7 or 8.
</p>

<p>
Actually we can narrow one step further, by taking advantage of the information from the other sub-grids, for instance, 7s in B and C have occupied the bottom two lanes, then the 7 must be in the top row for grid A. And then the same can be done for sub-grid D and G (which are the two sub-grids below A) etc.
</p>

<p>
Ok the above is what my brain does by doing a series of reasoning to eliminate and find out the right candidate or candidates, in this case its plural because there are multiple choices. By repeating this methodology, eventually there will be one position that will only have one possible candidate and the domino fall from there and after X number of steps the sudoku is solved.
</p>
</div>
<div id="outline-container-org9aa01de" class="outline-3">
<h3 id="org9aa01de"><span class="section-number-3">3.1.</span> How to translate into lisp code</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First of all, a data-structure is needed to hold the representation of a sudoku board in memory. In this case it's trivia to select a 2d array. In other more complicated computer problems, choosing and implementing the right data-structure will often help facilitate progress rather than hinder it, and choosing poorly will cause hindrance.
</p>

<p>
Anyhow, with a 2d array, the rows of a sudoku can be accessed with <code>O(1)</code> time. Accessing the columns is requires a bit more work. Although these matters less compared to the algorithm as because accessors for rows and columns are effectively function calls and the cost of the function in this case being row is both faster and cheaper can be optimized later on.
</p>

<p>
Moving onto the algorithm side, the program will start looking at one position at a time. For a position (i,j) it will look into the i-th row and j-th column and starts filtering down the possible candidates from there.
</p>

<p>
Normally, I would use a set to represent the combination of unique numbers from the row and column, for instance, in <a href="#org5a78f53">numbers in 1st row</a> we have the numbers from 1st row, and &lt;&gt; is the 1st column. The combined set is as shown in &lt;&gt;, with &lt;&gt; showing the missing numbers for that position.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Numbers in 1st row</caption>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(2 3 4 5)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Numbers in 1st column</caption>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(1 2 3 5 9)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Numbers in 1st row and 1st column</caption>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(1 2 3 4 5 9)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Numbers missing with consideration in 1st row and 1st column</caption>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(6 7 8)</td>
</tr>
</tbody>
</table>

<p>
Set is a good tool for holding the data I need. However, I wanted to try something different this time, with compactness in mind. The problem space here is, a way to encode the state of a row, column and region (sub-grid), given that each number from 1 to 9 are either present or missing. After some time I realized bit-mask is the right tool for this, what's better is that, there are boolean operation that helps combining two encodings. I settled with 1 as missing and 0 as present because of overlooked the operation "binary nor" and "binary and" only works with the chosen schema.
</p>

<p>
So as an example, if there is an encoding of <code>#*111000000</code> this means <code>1,2,3</code> are missing and the rest are present.
</p>
</div>
</div>
<div id="outline-container-org6ae3f81" class="outline-3">
<h3 id="org6ae3f81"><span class="section-number-3">3.2.</span> More on encoding</h3>
<div class="outline-text-3" id="text-3-2">
<p>
let's say i is 0 and j is 6 and we get the following encoding:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">encoding</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">row</td>
<td class="org-left">#*000001001</td>
</tr>

<tr>
<td class="org-left">column</td>
<td class="org-left">#*100011011</td>
</tr>

<tr>
<td class="org-left">region</td>
<td class="org-left">#*001011001</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">and*</td>
<td class="org-left">#*000001001</td>
</tr>
</tbody>
</table>

<p>
The encoding translate back into the possible candidates for this position which are (counted from the LSB as 1):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">6,</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
My solver started to step through the sudoku and filling in the numbers in their respective positions.
But then it halted at step 10
</p>
</div>
</div>
</div>
<div id="outline-container-org8542daa" class="outline-2">
<h2 id="org8542daa"><span class="section-number-2">4.</span> the second version</h2>
<div class="outline-text-2" id="text-4">
<p>
After looking carefully at the final state of the sudoku puzzle from the currently stuck position, I find out that all the empty spots were having more than 1 possible candidates, this prevented the solver from advancing to the next state.
</p>

<p>
It didn't took long to find out the solver wasn't taking the advantage of the numbers/information from the other "lanes" (rows and/or columns) to help narrow down the choice.
</p>

<pre class="example" id="org183eeac">
―――――――――――――
│...│345│.2.│
│349│7.6│..1│
│2.6│..1│47.│
―――――――――――――
│1.2│.79│.85│
│59.│...│...│
│.6.│...│219│
―――――――――――――
│91.│..7│.42│
│.27│913│.6.│
│...│...│...│
―――――――――――――
</pre>

<p>
Let's look at position <code>(4,0)</code> there are may be up to four possible candidates judging by the 1,2,5,6,9 in the grid. However, if we were to take advantage of the 7s in the grid to the right and below, we can see the only possible place is <code>(4,0)</code>. This way of reasoning is what the algorithm need to progress further from the stuck state.
</p>
</div>
</div>
