org/blogs/cl-sudoku-write-up.org
* the third version
** motivation
Stepping through the sudoku puzzle once more and this time we stopped at step 23.

Looking at the message it tells me the solver is unable to find a position with any candidates. Looking at the board right now, I see this is because there are  some contradicting numbers placed onto the board.

For instance, the 6 at =(0 . 6)= should have been a 9 instead. But why did the program decide to put that 6 there. Back to the encodings:

|---------+-------------|
| Name    | encoding    |
|---------+-------------|
| row     | #*000001001 |
| column  | #*100011011 |
| region  | #*001011001 |
|---------+-------------|
| result  | #*000001001 |
| numbers | 6, 9        |
|---------+-------------|

This tells me the newly added logic that took advantage of the information/numbers from the other lanes has mis-lead the program. Because for =(0 . 6)= and =(0 . 8)= either could have put a 6 or 9 down, but due to design of the searcher that simply goes column first then onto the next row meant that =(0 . 6)= got filled with a =6=.

Time to revise the searcher from positional to regional. The searcher should take into account of the impact of a conflicting choices, which tend to happen to spots within the same row, column or region. Instead of computing for one position at a time, the searcher should compute for 3 rows, 3 columns and 1 region.

** progress 

I thought to myself the best way to approach this is to start with a regional view, where we will consider the problem for all three rows, three columns and one single region.

# Before we dive deeper into the inner working of the mechanics. Let's define a few concepts,

# - *encoding*, is a 9bit mask which indicates which numbers are present and which are missing for any given row/column/region. For the benefit of easier computing 1 was chosen to represent when that number is missing and 0 for when it is present.

#   so =#*100111100= means ='(1 4 5 6 7)= are missing and ='(2 3 8 9)= are present

# - The final *mask* = row encoding & column encoding & region encoding.

#   The final mask refers to the combination of the encoding from row, column and region. The previous example also applies here.

From here the new algorithm is as follows:
- Start from one region, typically starts from region X, where X can be anything from 0 to 8
- Within region X, there are Y number of empty positions, and Z number of empty positions that has a mask with only 1 bit asserted
- there are Y number of masks for each of the empty position, where Y satisfy 0 < Y < X.
- From the Y masks there are Z number of masks with only 1 bit asserted
- Finally, those Z masks are translated back into the integer to fill back into the Sudoku board.

With the algorithm detailed above implemented after stepping through the program a couple times the Sudoku board is finally solved
