html/blogs/cl-sudoku-write-up.html
<div id="outline-container-orga87bb33" class="outline-2">
<h2 id="orga87bb33"><span class="section-number-2">5.</span> the third version</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org74701af" class="outline-3">
<h3 id="org74701af"><span class="section-number-3">5.1.</span> motivation</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Stepping through the sudoku puzzle once more and this time we stopped at step 23.
</p>

<p>
Looking at the message it tells me the solver is unable to find a position with any candidates. Looking at the board right now, I see this is because there are  some contradicting numbers placed onto the board.
</p>

<p>
For instance, the 6 at <code>(0 . 6)</code> should have been a 9 instead. But why did the program decide to put that 6 there. Back to the encodings:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">encoding</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">row</td>
<td class="org-left">#*000001001</td>
</tr>

<tr>
<td class="org-left">column</td>
<td class="org-left">#*100011011</td>
</tr>

<tr>
<td class="org-left">region</td>
<td class="org-left">#*001011001</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">result</td>
<td class="org-left">#*000001001</td>
</tr>

<tr>
<td class="org-left">numbers</td>
<td class="org-left">6, 9</td>
</tr>
</tbody>
</table>

<p>
This tells me the newly added logic that took advantage of the information/numbers from the other lanes has mis-lead the program. Because for <code>(0 . 6)</code> and <code>(0 . 8)</code> either could have put a 6 or 9 down, but due to design of the searcher that simply goes column first then onto the next row meant that <code>(0 . 6)</code> got filled with a <code>6</code>.
</p>

<p>
Time to revise the searcher from positional to regional. The searcher should take into account of the impact of a conflicting choices, which tend to happen to spots within the same row, column or region. Instead of computing for one position at a time, the searcher should compute for 3 rows, 3 columns and 1 region.
</p>
</div>
</div>
<div id="outline-container-org9883dac" class="outline-3">
<h3 id="org9883dac"><span class="section-number-3">5.2.</span> progress</h3>
<div class="outline-text-3" id="text-5-2">
<p>
I thought to myself the best way to approach this is to start with a regional view, where we will consider the problem for all three rows, three columns and one single region.
</p>

<p>
From here the new algorithm is as follows:
</p>
<ul class="org-ul">
<li>Start from one region, typically starts from region X, where X can be anything from 0 to 8</li>
<li>Within region X, there are Y number of empty positions, and Z number of empty positions that has a mask with only 1 bit asserted</li>
<li>there are Y number of masks for each of the empty position, where Y satisfy 0 &lt; Y &lt; X.</li>
<li>From the Y masks there are Z number of masks with only 1 bit asserted</li>
<li>Finally, those Z masks are translated back into the integer to fill back into the Sudoku board.</li>
</ul>

<p>
With the algorithm detailed above implemented after stepping through the program a couple times the Sudoku board is finally solved
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Danny</p>
<p class="date">Created: 2026-01-11 Sun 02:11</p>
</div>
</body>
</html>
